OpenSocial20090611/moso/srv/trunk/app/controllers/locations_controller.rb

  def create
    @location = Location.new(params[:location])
    #@location = Location.new(:setX => params[:setX],
    #                         :setY => params[:setY],
    #                         :setPhoto => params[:setPhoto],
    #                         :comment => params[:comment],
    #                         :kinds => params[:kinds])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("setX", "comment", "kinds", "setY", "created_at", "updated_at", "setPhoto", "userId") VALUES('35.709235', '神楽坂です。', 1, '139.734249', '2009-06-11 04:15:58', '2009-06-11 04:15:58', 'http://www.orkut.com/Main#AlbumZoom.aspx?uid=1221984505246422082&aid=1&pid=1244693164092$pid=1244693164092', '1221984505246422082')