trunk/OpenSocial20090515/TruthOfKen/server/app/controllers/accounts_controller.rb

SELECT * FROM "accounts" WHERE ("accounts"."activation_code" = '8d8a73d1faadd003b799e20924149d70ab0730b2') LIMIT 1
---
  def activate
    logout_keeping_session!
    account = Account.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1) LIMIT 1
---
  def show
    @account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1) LIMIT 1
---
  def edit
    #TODO ここにログインユーザでかつ、そのIDのアカウント情報の更新なのか確認をいれる。

    @account = Account.find(params[:id])