trunk/OpenSocial20090515/TruthOfKen/server/app/controllers/answers_controller.rb

  def index
    @answers = Answer.find(:all, :conditions => ['prefecture_id = ? and question_id = ? ', params[:prefecture],params[:question_id]], :order => "rate DESC")
---
SELECT * FROM "answers" WHERE (prefecture_id = '1' and question_id = '5' ) ORDER BY rate DESC